app/Services/BaseService.php

select * from `settings` where `key` = 'comapny_info' limit 1
---
    public function getCompanyDetails($key="")
    {
        $queryInstance = Setting::where('key',$key)->first();

select * from `customer_orders` where `type` = 'inward' order by `created_at` desc limit 1
---
    public function getMaxSerialNo($type){
        //$serial_number = CustomerOrders::where('type',$type)->max('sr_no');
        $CustomerOrder = CustomerOrders::withTrashed()->where('type',$type)->latest()->first();

select * from `items` left join `order_items` as `oi` on `items`.`item_id` = `oi`.`item_id` left join `customer_orders` as `co` on `oi`.`customer_order_id` = `co`.`customer_order_id` where `co`.`customer_id` = 12 group by `oi`.`item_id` order by `name` asc
---
    public function fetchCustomerItems($customer_id="")
    {
        $items = Item::leftjoin('order_items as oi','items.item_id','=','oi.item_id')
                    ->leftjoin('customer_orders as co','oi.customer_order_id','=','co.customer_order_id')
                    ->where('co.customer_id',$customer_id)
                    ->withTrashed()->orderBy('name')->groupBy('oi.item_id')->get();