app/Services/CustomerOrderService.php

select SUM(IF(customer_orders.type ='inward', additional_charge, 0)) as total_inward_additional_charge, SUM(IF(customer_orders.type ='outward', additional_charge, 0)) as total_outward_additional_charge, SUM(additional_charge) as total_additional_charge from `customer_orders` where date(`customer_orders`.`date`) >= '2025-05-01' and date(`customer_orders`.`date`) <= '2025-05-27' and `customer_orders`.`customer_id` = '238' and `customer_orders`.`deleted_at` is null limit 1
---
    public function calculateAdditionalCharge(Request $request){
        $queryInstance = $this->model->select(DB::raw("SUM(IF(customer_orders.type ='inward', additional_charge, 0)) as total_inward_additional_charge"),DB::raw("SUM(IF(customer_orders.type ='outward', additional_charge, 0)) as total_outward_additional_charge"),DB::raw("SUM(additional_charge) as total_additional_charge"));

        if($request->filled('from')) {
            $from = Helper::convertDateFormat($request->input('from'));
            $queryInstance->whereDate('customer_orders.date','>=', $from);
        }
        if($request->filled('to')) {
            $to = Helper::convertDateFormat($request->input('to'));
            $queryInstance->whereDate('customer_orders.date','<=',$to);
        }
        if($request->filled('c') && $request->input('c') != "all_customer") {
            $customer_id = $request->input('c');
            $queryInstance->where('customer_orders.customer_id', $customer_id);
        }
        return $queryInstance->first();