app/Services/CustomerService.php

    public function update($id,$request)
    {
        $customer = Customer::findOrFail($id);
        $request_arr = $request->all();

        if ($request->hasFile('photo'))
        {
            $customer->deleteFile($customer->getRawOriginal('photo'));
            $file_path = Helper::uploadImg($request->file('photo'),config ('constant.CUSTOMER_PROFILE_PATH'));
            if($file_path)
            {
                $request_arr['photo'] = $file_path;
            }
        }
        else{
            if(isset($customer->photo))
                $request_arr['photo'] = config ('constant.CUSTOMER_PROFILE_PATH').'/'. basename($customer->photo);
        }
        if($customer)
        {
            $customer->fill($request_arr);
            if($customer->save()){
---
select * from `customers` where `customers`.`customer_id` = '312' and `customers`.`deleted_at` is null limit 1
update `customers` set `gstnumber` = 'GST12', `contact_person` = 'TANDEL TEJAS', `phone` = '9904655210', `photo` = 'customer/profile/default-avatar.png', `customers`.`updated_at` = '2025-05-26 15:38:10' where `customer_id` = 312