app/Services/OrderItemService.php

   public function calculateInwardOutwardWeight(Request $request){
        $queryInstance = OrderItems::select(DB::raw("SUM(IF(order_items.type='inward',order_items.quantity*order_items.weight,0)) as total_inward_weight"),DB::raw("SUM(IF(order_items.type='outward',order_items.quantity*order_items.weight,0)) as total_outward_weight"))
            ->leftJoin("customer_orders as co","co.customer_order_id",'=',"order_items.customer_order_id")
            ->whereNull('order_items.deleted_at');


        if($request->filled('from')) {
            $from = Helper::convertDateFormat($request->input('from'));
            $dt = Carbon::parse($from);
            $from = $dt->toDateString();

            $queryInstance->where('co.date','>=', $from);
        }
        else{
            $from='';
        }
        if($request->filled('to')) {
            $to = Helper::convertDateFormat($request->input('to'));
            $dt = Carbon::parse($to);
            $to = $dt->toDateString();

            $queryInstance->where('co.date','<=',$to);
        }

        if($request->filled('c') && $request->input('c') != "all_customer") {
            $customer_id = $request->input('c');
            $queryInstance->where('co.customer_id',$customer_id);
        }

        return $queryInstance->first();
---
select SUM(IF(order_items.type='inward',order_items.quantity*order_items.weight,0)) as total_inward_weight, SUM(IF(order_items.type='outward',order_items.quantity*order_items.weight,0)) as total_outward_weight from `order_items` left join `customer_orders` as `co` on `co`.`customer_order_id` = `order_items`.`customer_order_id` where `order_items`.`deleted_at` is null and `co`.`date` >= '2025-05-01' and `co`.`date` <= '2025-05-27' and `co`.`customer_id` = '238' and `order_items`.`deleted_at` is null limit 1