app/Services/UserService.php

    public function update($id,$request)
    {
        $user = User::findOrFail($id);
        $request_arr = $request->all();

        if ($request->hasFile('photo'))
        {
            $user->deleteFile($user->getRawOriginal('photo'));
            $file_path = Helper::uploadImg($request->file('photo'),config('constant.USER_PROFILE_PATH'));

            if($file_path)
            {
                $request_arr['photo'] = $file_path;
            }
        }
        else{
            if(isset($user->photo))
                $request_arr['photo'] = config('constant.USER_PROFILE_PATH').'/'. basename($user->photo);
        }
        if($user)
        {
            $user->fill($request_arr);
            if($user->save()){
---
select * from `users` where `users`.`user_id` = '12' and `users`.`deleted_at` is null limit 1
update `users` set `username` = '123new', `firstname` = 'tejas', `lastname` = 'tandel', `photo` = 'profile/default-avatar.png', `users`.`updated_at` = '2025-05-26 15:39:43' where `user_id` = 44