app/Http/Controllers/Web/FullLedgerReportController.php

select * from `chamber` where `chamber`.`deleted_at` is null
select * from `floor` where `floor`.`deleted_at` is null
select * from `grid` where `grid`.`deleted_at` is null
---
    public function show(Request $request)
    {
        $data =[
            'pagetitle'=>"Stocks Report",
            "breadcrumbs"=>array("Home"=>route('user.home'),"Ledger Report"=>""),
            'menuParent'=>'reports',
            'menuChild'=>'full-ledger'
        ];

        $user = Auth::user();
        $customer_id = $user->customer_id;

        $request['c'] = $customer_id;

        $chambers = Chamber::all()->keyBy('chamber_id');
        $floors = Floor::all()->keyBy('floor_id');
        $grids = Grid::all()->keyBy('grid_id');