app/Http/Controllers/Web/OutwardsController.php

select * from `customers` where `customer_id` = 12 order by `companyname` asc
select sum(`additional_charge`) as aggregate from `customer_orders` left join `customers` as `c` on `c`.`customer_id` = `customer_orders`.`customer_id` left join `users` as `u` on `u`.`user_id` = `customer_orders`.`user_id` where `customer_orders`.`type` = 'outward' and `customer_orders`.`customer_id` = 12 and `customer_orders`.`deleted_at` is null
select `customer_orders`.*, `c`.*, `c`.`address` as `customer_add`, `customer_orders`.`address` as `delivery_address`, `u`.`username` as `username`, `customer_orders`.`created_at` as `order_created_date` from `customer_orders` left join `customers` as `c` on `c`.`customer_id` = `customer_orders`.`customer_id` left join `users` as `u` on `u`.`user_id` = `customer_orders`.`user_id` where `customer_orders`.`type` = 'outward' and `customer_orders`.`customer_id` = 12 and `customer_orders`.`deleted_at` is null order by `customer_orders`.`date` desc, `sr_no` desc, `customer_order_id` desc limit 100 offset 0
select count(*) as aggregate from `customer_orders` left join `customers` as `c` on `c`.`customer_id` = `customer_orders`.`customer_id` left join `users` as `u` on `u`.`user_id` = `customer_orders`.`user_id` where `customer_orders`.`type` = 'outward' and `customer_orders`.`customer_id` = 12 and `customer_orders`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $data = [
			'pagetitle'=>'All Outward',
            'breadcrumbs'=>array("Home"=>route('user.home'),"Outwards"=>""),
            'menuParent'=>'outwards',
            'menuChild'=>'alloutward'
        ];
        $user = Auth::User();
        $request['customer_id'] = $user->customer_id;

        $show = $request->filled('p') ? $request->input('p') : 100 ;

        $customers = Customer::where('customer_id',$user->customer_id)->withTrashed()->orderBy('companyname')->get();

        $queryInstance = $this->customerorder_obj->filterListByType($request, config('constant.CUSTOMER_ORDER_TYPE.OUTWARD'));
        $total_additional_charge = $queryInstance->sum('additional_charge');
        $customer_orders = $queryInstance->orderBy('customer_orders.date','desc')->orderBy('sr_no','desc')->orderBy('customer_order_id','desc')->Paginate($show);