app/Http/Controllers/Web/UserController.php

    public function update(UserProfileRequest $request, $id)
    {
        $type = "error";
        $message = "Sorry, failed to edit your profile. Please try again.";

        $user = User::find($id);
---
select * from `users` where `users`.`user_id` = '12' and `users`.`deleted_at` is null limit 1