app/Models/Marka.php

select * from `marka` where `item_id` in (40) order by `name` asc
---
    public function getMarkaByItemId($id){
        if(is_array($id)){
            return Marka::withTrashed()->whereIn('item_id',$id)->orderBy('name','asc')->get();