app/Http/Controllers/Admin/CustomerController.php

    public function index(Request $request)
    {
        $user = Auth::user();
        $data = [
			'pagetitle'=>"All Customers",
            "breadcrumbs"=>array("Home"=>route('admin.home'),"Customers"=>route('admin.customers.index')),
            'menuParent'=>'customers',
            'menuChild'=>'customers'
        ];

        $keyword = $request->input('keyword');
        $queryInstance = Customer::whereNull('customers.deleted_at');
        $search_fields = array('companyname','address','phone');

        if($keyword != "") {
            //SEARCH KEYWORD
            $this->customer_obj->filterByKeywords($search_fields,$queryInstance,$keyword);
        }

        $customers = $queryInstance->orderBy('companyname','asc')->paginate(config('constant.PAGINATION'));
---
select * from `customers` where `customers`.`deleted_at` is null and `customers`.`deleted_at` is null order by `companyname` asc limit 100 offset 0
select count(*) as aggregate from `customers` where `customers`.`deleted_at` is null and `customers`.`deleted_at` is null

    public function edit($id)
    {
        $data = [
			'pagetitle'=>"Edit Customer",
            "breadcrumbs"=>array("Home"=>route('admin.home'),"Customers"=>route('admin.customers.index'),"Edit"=>""),
            'menuParent'=>'customers',
            'menuChild'=>'customers'
		];

        $customer = Customer::findOrFail($id);

        $users = User::where('customer_id',$id)->get();
---
select * from `customers` where `customers`.`customer_id` = '312' and `customers`.`deleted_at` is null limit 1
select * from `users` where `customer_id` = '312' and `users`.`deleted_at` is null

    public function editUser($id)
    {

        $user = User::findOrFail($id);
---
select * from `users` where `users`.`user_id` = '44' and `users`.`deleted_at` is null limit 1