app/Http/Controllers/Admin/FullLedgerReportController.php

select * from `chamber` where `chamber`.`deleted_at` is null
select * from `floor` where `floor`.`deleted_at` is null
select * from `grid` where `grid`.`deleted_at` is null
select * from `items` order by `name` asc
select * from `customers` order by `companyname` asc
---
    public function show(Request $request)
    {
        $data =[
            'pagetitle'=>"Stocks Report",
            "breadcrumbs"=>array("Home"=>route('admin.home'),"Ledger Report"=>""),
            'menuParent'=>'reports',
            'menuChild'=>'full-ledger'
        ];
        $user = Auth::user();

        $chambers = Chamber::all()->keyBy('chamber_id');
        $floors = Floor::all()->keyBy('floor_id');
        $grids = Grid::all()->keyBy('grid_id');

        $items = Item::withTrashed()->orderBy('name')->get();

        if($request->filled('i')){
            $markas = Marka::withTrashed()->where('item_id',$request->input('i'))->orderBy('name')->get();
        }
        else{
            $markas = collect();
        }

        $customers = Customer::withTrashed()->orderBy('companyname')->get();