app/Http/Controllers/Admin/HomeController.php

select * from `customers` order by `companyname` asc
---
    public function index(Request $request)
    {
        $data=[
            'pagetitle'=>"Dashboard",
            'menuParent'=>'dashboard',
            'menuChild'=>'dashboard'
        ];

        $customers = Customer::withTrashed()->orderBy('companyname')->get();