app/Http/Controllers/Admin/InsuranceReportsController.php

select * from `items` order by `name` asc
select * from `customers` order by `companyname` asc
---
    public function show(Request $request)
    {
        $user = Auth::user();
        $data = [
            'pagetitle'=>"Insurance Report",
            "breadcrumbs"=>array("Home"=>route('admin.home'),"Statement Of Insurance"=>""),
            'menuParent'=>'reports',
            'menuChild'=>'insuarnce-report'
        ];

        $items = Item::withTrashed()->orderBy('name')->get();

        $customers = Customer::withTrashed()->orderBy('companyname')->get();