app/Http/Controllers/Admin/InwardsController.php

    public function index(Request $request)
    {
        $data = [
			'pagetitle'=>'All Inward',
            'breadcrumbs'=>array("Home"=>route('admin.home'),"Inwards"=>""),
            'menuParent'=>'inwards',
            'menuChild'=>'allinward'
        ];
        $show = $request->filled('p') ? $request->input('p') : 100 ;

        $customers = Customer::withTrashed()->orderBy('companyname')->get();
        $queryInstance = $this->customerorder_obj->filterListByType($request, config('constant.CUSTOMER_ORDER_TYPE.INWARD'));
        $total_additional_charge = $queryInstance->sum('additional_charge');
        $customer_orders = $queryInstance->orderBy('customer_orders.date','desc')->orderBy('sr_no','desc')->orderBy('customer_order_id','desc')->Paginate($show);
---
select * from `customers` order by `companyname` asc
select sum(`additional_charge`) as aggregate from `customer_orders` left join `customers` as `c` on `c`.`customer_id` = `customer_orders`.`customer_id` left join `users` as `u` on `u`.`user_id` = `customer_orders`.`user_id` where `customer_orders`.`type` = 'inward' and `customer_orders`.`deleted_at` is null
select `customer_orders`.*, `c`.*, `c`.`address` as `customer_add`, `customer_orders`.`address` as `delivery_address`, `u`.`username` as `username`, `customer_orders`.`created_at` as `order_created_date` from `customer_orders` left join `customers` as `c` on `c`.`customer_id` = `customer_orders`.`customer_id` left join `users` as `u` on `u`.`user_id` = `customer_orders`.`user_id` where `customer_orders`.`type` = 'inward' and `customer_orders`.`deleted_at` is null order by `customer_orders`.`date` desc, `sr_no` desc, `customer_order_id` desc limit 100 offset 0
select count(*) as aggregate from `customer_orders` left join `customers` as `c` on `c`.`customer_id` = `customer_orders`.`customer_id` left join `users` as `u` on `u`.`user_id` = `customer_orders`.`user_id` where `customer_orders`.`type` = 'inward' and `customer_orders`.`deleted_at` is null

    public function showReceipt(Request $request,$id)
    {
        $data = [
            'pagetitle'=>"Inward Receipt",
            "breadcrumbs"=>array("Home"=>route('admin.home'),"Inwards"=>route('admin.inwards.index'),"Receipt"=>""),
            'menuParent'=>'inwards',
            'menuChild'=>'allinward'
        ];
        $user = Auth::user();
        $company_info = $this->customerorder_obj->getCompanyDetails(config('constant.SETTINGS_KEY'));

        $customer_order = $this->customerorder_obj->getCustomerOrder(config('constant.CUSTOMER_ORDER_TYPE.INWARD'),$id)->withTrashed()->first();
        $order_items = $this->orderitem_obj->getOrderItems($id,config('constant.CUSTOMER_ORDER_TYPE.INWARD'),$request)->withTrashed()->get();
---
select `customer_orders`.*, `c`.*, `c`.`address` as `customer_add`, `customer_orders`.`address` as `delivery_address`, `u`.`username` as `username`, `customer_orders`.`created_at` as `order_created_date` from `customer_orders` left join `customers` as `c` on `c`.`customer_id` = `customer_orders`.`customer_id` left join `users` as `u` on `u`.`user_id` = `customer_orders`.`user_id` where `customer_orders`.`type` = 'inward' and `customer_orders`.`customer_order_id` = '29635' limit 1
select `order_items`.*, `i`.`name` as `item_name`, `m`.`name` as `marka_name`, `f`.`number` as `floor_number`, `g`.`number` as `grid_number`, `c`.`number` as `chamber_number` from `order_items` left join `customer_orders` as `co` on `co`.`customer_order_id` = `order_items`.`customer_order_id` left join `items` as `i` on `i`.`item_id` = `order_items`.`item_id` left join `floor` as `f` on `f`.`floor_id` = `order_items`.`floor_id` left join `grid` as `g` on `g`.`grid_id` = `order_items`.`grid_id` left join `chamber` as `c` on `c`.`chamber_id` = `order_items`.`chamber_id` left join `marka` as `m` on `m`.`marka_id` = `order_items`.`marka_id` where `co`.`customer_order_id` = '29635' and `co`.`type` = 'inward' order by `order_items`.`order_item_id` asc