app/Http/Controllers/Admin/ItemController.php

select * from `items` where `deleted_at` is null and `items`.`deleted_at` is null order by `name` asc limit 25 offset 0
select count(*) as aggregate from `items` where `deleted_at` is null and `items`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $data=[
            'pagetitle'=>"All Items",
            "breadcrumbs"=>array("Home"=>route('admin.home'),"Items"=>""),
            'menuParent'=>'items',
            'menuChild'=>'items'
        ];

        $show = $request->filled('show') ? $request->input('show') : 25 ;
        $keyword = $request->input('keyword');
        $search_fields = array('name','description');
        $queryInstance = Item::whereNull('deleted_at');

        if($keyword != "") {
            //SEARCH KEYWORD
            $this->item_obj->filterByKeywords($search_fields,$queryInstance,$keyword);
        }
        $items = $queryInstance->orderBy('name','asc')->paginate($show);

select * from `items` where `items`.`item_id` = '494' and `items`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        $data = [
			'pagetitle'=>"Edit Item",
			"breadcrumbs"=>array("Home"=>route('admin.home'),"Items"=>route('admin.items.index'),"Edit"=>""),
            'menuParent'=>'items',
            'menuChild'=>'items'
        ];

        $item = Item::findOrFail($id);