app/Http/Controllers/Admin/MarkaController.php

    public function index(Request $request)
    {
        $data=[
            'pagetitle'=>"All Marka",
            "breadcrumbs"=>array("Home"=>route('admin.home'),"Markas"=>""),
            'menuParent'=>'items',
            'menuChild'=>'item-markas'
        ];

        $show = $request->filled('show') ? $request->input('show') : 25 ;
        $keyword = $request->input('keyword');
        $items = Item::orderBy('name')->get();
        $queryInstance = Marka::select('marka.*','i.name as item_name')
                        ->leftJoin('items as i', function($join) {
                            $join->on('marka.item_id', '=', 'i.item_id');
                        });

        if($request->filled('item_id')) {
            $item_id = $request->input('item_id');
            $queryInstance->where('marka.item_id',$item_id);
        }

        $search_fields = array('marka.name','i.name');
        if($keyword != "") {
            $this->marka_obj->filterByKeywords($search_fields,$queryInstance,$keyword);
        }
        $markas = $queryInstance->orderBy("marka.name")->paginate($show);
---
select * from `items` where `items`.`deleted_at` is null order by `name` asc
select `marka`.*, `i`.`name` as `item_name` from `marka` left join `items` as `i` on `marka`.`item_id` = `i`.`item_id` where ((`marka`.`name` like '%Marka%') or (`i`.`name` like '%Marka%')) and `marka`.`deleted_at` is null order by `marka`.`name` asc limit 25 offset 0
select count(*) as aggregate from `marka` left join `items` as `i` on `marka`.`item_id` = `i`.`item_id` where ((`marka`.`name` like '%Marka%') or (`i`.`name` like '%Marka%')) and `marka`.`deleted_at` is null

    public function edit($id)
    {
        $data = [
			'pagetitle'=>"Edit Marka",
			"breadcrumbs"=>array("Home"=>route('admin.home'),"Markas"=>route('admin.item-marka.index'),"Edit"=>""),
            'menuParent'=>'items',
            'menuChild'=>'item-markas'
        ];

        $marka = Marka::findOrFail($id);
---
select * from `marka` where `marka`.`marka_id` = '2063' and `marka`.`deleted_at` is null limit 1