app/Http/Controllers/Admin/OrderTrashController.php

    public function index(Request $request)
    {
        $data =[
            'pagetitle'=>"All Trash Orders",
            "breadcrumbs"=>array("Home"=>route('admin.home'),"All Trash Orders"=>""),
            'menuParent'=>'trash',
            'menuChild'=>'trashorders'
        ];
        $show = $request->filled('p') ? $request->input('p') : 100 ;
        $customers = Customer::withTrashed()->orderBy('companyname')->get();
---
select * from `customers` order by `companyname` asc

	//print_r($customer_orders->toArray());
	//exit(0);

        return view('admin.trash.order',$data)->with(compact('customer_orders','request','customers','show','total_additional_charge'));
---
select count(*) as aggregate from `customer_orders` left join `customers` as `c` on `c`.`customer_id` = `customer_orders`.`customer_id` left join `users` as `u` on `u`.`user_id` = `customer_orders`.`deleted_user_id` where `customer_orders`.`deleted_at` is not null and `customer_orders`.`deleted_at` is not null