app/Http/Controllers/Admin/OutwardsController.php

select * from `customers` order by `companyname` asc
select sum(`additional_charge`) as aggregate from `customer_orders` left join `customers` as `c` on `c`.`customer_id` = `customer_orders`.`customer_id` left join `users` as `u` on `u`.`user_id` = `customer_orders`.`user_id` where `customer_orders`.`type` = 'outward' and `customer_orders`.`deleted_at` is null
select `customer_orders`.*, `c`.*, `c`.`address` as `customer_add`, `customer_orders`.`address` as `delivery_address`, `u`.`username` as `username`, `customer_orders`.`created_at` as `order_created_date` from `customer_orders` left join `customers` as `c` on `c`.`customer_id` = `customer_orders`.`customer_id` left join `users` as `u` on `u`.`user_id` = `customer_orders`.`user_id` where `customer_orders`.`type` = 'outward' and `customer_orders`.`deleted_at` is null order by `customer_orders`.`date` desc, `sr_no` desc, `customer_order_id` desc limit 100 offset 0
select count(*) as aggregate from `customer_orders` left join `customers` as `c` on `c`.`customer_id` = `customer_orders`.`customer_id` left join `users` as `u` on `u`.`user_id` = `customer_orders`.`user_id` where `customer_orders`.`type` = 'outward' and `customer_orders`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $data = [
			'pagetitle'=>'All Outward',
            'breadcrumbs'=>array("Home"=>route('admin.home'),"Outwards"=>""),
            'menuParent'=>'outwards',
            'menuChild'=>'alloutward'
        ];

        $show = $request->filled('p') ? $request->input('p') : 100 ;
        $customers = Customer::withTrashed()->orderBy('companyname')->get();
        $queryInstance = $this->customerorder_obj->filterListByType($request, config('constant.CUSTOMER_ORDER_TYPE.OUTWARD'));
        $total_additional_charge = $queryInstance->sum('additional_charge');
        $customer_orders = $queryInstance->orderBy('customer_orders.date','desc')->orderBy('sr_no','desc')->orderBy('customer_order_id','desc')->Paginate($show);

select `customer_orders`.*, `c`.*, `c`.`address` as `customer_add`, `customer_orders`.`address` as `delivery_address`, `u`.`username` as `username`, `customer_orders`.`created_at` as `order_created_date` from `customer_orders` left join `customers` as `c` on `c`.`customer_id` = `customer_orders`.`customer_id` left join `users` as `u` on `u`.`user_id` = `customer_orders`.`user_id` where `customer_orders`.`type` = 'outward' and `customer_orders`.`customer_order_id` = '29761' limit 1
---
    public function showReceipt(Request $request,$id)
    {
        $data = [
            'pagetitle'=>"Outward Receipt",
            "breadcrumbs"=>array("Home"=>route('admin.home'),"Outwards"=>route('admin.outwards.index'),"Receipt"=>""),
            'menuParent'=>'outwards',
            'menuChild'=>'alloutward'
        ];
        $user = Auth::User();

        $company_info = $this->customerorder_obj->getCompanyDetails(config('constant.SETTINGS_KEY'));

        $customer_order = $this->customerorder_obj->getCustomerOrder(config('constant.CUSTOMER_ORDER_TYPE.OUTWARD'),$id)->withTrashed()->first();

select * from `customer_orders` where `customer_orders`.`customer_order_id` = '29761' limit 1
select * from `order_items` where `type` = 'outward' and `customer_order_id` = '29761' order by `order_item_id` asc
---
    public function edit(Request $request,Marka $obj_marka, $id)
    {
        $customer_order = CustomerOrders::withTrashed()->findOrFail($id);
        $data = [
			'pagetitle'=>"Edit Outward",
            "breadcrumbs"=>array("Home"=>route('admin.home'),"Outwards"=>route('admin.outwards.index'),"Edit"=>""),
            'menuParent'=>'outwards',
            'menuChild'=>'outward'
		];

        list($items, , $chambers, $floors, $grids,) = $this->customerorder_obj->pluckData(["item_id","chamber_id","floor_id","grid_id"]);
        $customers = Customer::withTrashed()->Active()->orderBy('companyname','asc')->get();
        $order_items = OrderItems::withTrashed()->Outward()->where('customer_order_id',$id)->orderBy('order_item_id', 'ASC')->get();