app/Http/Controllers/Admin/StockReportsController.php

select `chamber_id`, `floor_id`, `grid_id`, sum(IF(type='inward', weight*quantity , 0)) AS totalinwards, sum(IF(type='outward', weight*quantity , 0)) AS totaloutwards from `order_items` where `chamber_id` = '1' and `order_items`.`deleted_at` is null group by `chamber_id`, `floor_id`, `grid_id` order by `chamber_id` asc, `floor_id` asc, `grid_id` asc
---
    public function show(Request $request)
    {
        $user = Auth::user();
        $data = [
            'pagetitle'=>"Storage Capacity Report",
            "breadcrumbs"=>array("Home"=>route('admin.home'),"Storage Capacity"=>""),
            'menuParent'=>'reports',
            'menuChild'=>'stock-report'
        ];

        list( , ,$chambers,$floors,$grids, ) = $this->orderitem_obj->pluckData(["chamber_id","floor_id","grid_id"]);
        $results = $this->orderitem_obj->manageStorageCapacity($request)->get();