app/Http/Controllers/Admin/UserController.php

    public function index(Request $request)
    {
        $user = Auth::user();
        $data = [
            'pagetitle'=>"All Admins",
            "breadcrumbs"=>array("Home"=>route('admin.home'),"All Admins"=>""),
            'menuParent'=>'customers',
            'menuChild'=>'admins'
        ];

        $keyword = $request->input('keyword');
        $queryInstance = User::where('role_id',config('constant.ROLE_ADMIN_ID'));
        $search_fields = array('firstname','lastname','username','email');

        if($keyword != "") {
            //SEARCH KEYWORD
            $this->user_obj->filterByKeywords($search_fields,$queryInstance,$keyword);
        }

        $users = $queryInstance->paginate(config('constant.PAGINATION'));
---
select * from `users` where `role_id` = 2 and `users`.`deleted_at` is null limit 100 offset 0
select count(*) as aggregate from `users` where `role_id` = 2 and `users`.`deleted_at` is null

    public function edit($id)
    {
        if(Auth::check())
        {
            $data = [
    			'pagetitle'=>"My Profile",
    			"breadcrumbs"=>array("Home"=>route('admin.home'),"My Profile"=>""),
                'menuParent'=>'user',
                'menuChild'=>'user'
            ];

            $user = User::find($id);

            $company = Setting::where('key',config('constant.SETTINGS_KEY'))->first();
---
select * from `users` where `users`.`user_id` = '45' and `users`.`deleted_at` is null limit 1
select * from `settings` where `key` = 'comapny_info' limit 1

    public function update(UserProfileRequest $request, $id)
    {
        $type = "error";
        $message = "Sorry, failed to edit user profile. Please try again.";

        $user = User::find($id);
---
select * from `users` where `users`.`user_id` = '1' and `users`.`deleted_at` is null limit 1

    public function updateCompanyINFO(Request $request, $id)
    {
        $type = "error";
        $message = "Sorry, failed to edit user profile. Please try again.";

        $request_arr = $request->except(['_method','_token']);
        $detail = Setting::find($id);
---
select * from `settings` where `settings`.`id` = '1' limit 1